import gitHub from './public/icons8-github.svg';
import telegram from './public/icons8-telegtam.svg';
import phone from './public/icons-phone.svg'; //таким способом можно добавлять иконки самостоятельно, главно указать путь и имя файла.
import photo from './photo/photo.jpeg'; //если захочешь поменять фото, то нужно будет загрузить ее в папку photo и переименовать фото на имя "photo.jpeg". Либо можно поменять название в импорте

// Здесь предоставлен объект, который используется для отобращения контента в приложении.
// Все данные в объекте передаются в контекст, поэтому если будут изминения в данном файле, изменится и контент в проложении.
// Объект содержит 4 секции: контакты с фото, краткая информация, место работы, образование.
// В случае если запутаешься в свойствах, то скопируй данные со страницы и сделай поиск по файлу, и найдешь свой 

const listContents = {
  photo: photo,
  //контакты в разных messengers
  asideInfo: [
    {
      svg: gitHub,
      link: 'https://github.com/vladis62',
      alt: 'gitHub',//прописывать обязательно, выступает в качестве id
      text: 'github.com/vladis62'
    },
    {
      svg: telegram,
      link: 'https://t.me/vlad_os62',
      alt: 'telegram',//прописывать обязательно, выступает в качестве id
      text: '@vlad_os62'
    },
    {
      svg: phone, //если ты добавил новый контакт, то создай ниже похожий объект и в под данным клучем передавай иконку.
      link: 'tel:+79105700772', //если у тебя нет ссылки, то передавай пустую строку ''
      alt: 'phone', //прописывать обязательно, выступает в качестве id
      text: '+7 (910) 570-07-72'
    },
  ],
  briefInformation: {
    skills: [
      'Git',
      'Kotlin',
      'Docker',
      'Kafka',
      'Java',
      'SQL'],// Список скиллов
    aboutMeText: 'Я увлечен программированием. С помощью неисчерпаемой мотивации и трудолюбия непрерывно обучаюсь новому, изучаю новые технология, с помощью проб и ошибок становлюсь лучше как разработчик. Мне правится создавать действительно полезные продукты, выстраивая согласованную архитектуру в соответствии с лучшими практиками.',// About me текст к отображения
    languages: [
      { id: 'Russian', text: 'Russian | Native' },
      { id: 'English', text: 'English | Flue' },
    ],
  },
  workExperience: [
    {
      nameСompany: 'Tinkoff',
      experience: '2020-н.в',
      tasks: [
        'Работал над проектом.....',
        'Также работал над.....',
        'Также работал над.....',

      ],
      usedStack: ['Git', 'Kotlin', 'Docker', 'Kafka', 'SQL'],
    },//чтобы добавить организацию скопируй объект выше и создай новый через запятую. После меняешь значения (ключи не трогать!). Если захочешь что-то еще добавить, то пиши мне.
  ],
  education: {
    publicEducations: [
      {
        institution: 'ФГБОУ ВО "Рязанский Государственный Радиотехнический Университет им. В.Ф. Уткина", ФГБОУ ВО "Ргрту"',
        experience: '2009-2014',
      }
    ],
    courses: [
      {
        institution: 'Тинькофф Финтех',
        topic: 'Основы Java',
        experience: '2020',
      },
      {
        institution: 'Яндекс Практикум',
        topic: 'Алгоритмы и структуры данных',
        experience: '2024',
      }
    ]
  },
}

export default listContents;