import email from './public/email.svg';
import telegram from './public/icons8-telegtam.svg';
import phone from './public/icons-phone.svg'; //таким способом можно добавлять иконки самостоятельно, главно указать путь и имя файла.
// import photo from './photo/photo.jpeg'; //если захочешь поменять фото, то нужно будет загрузить ее в папку photo и переименовать фото на имя "photo.jpeg". Либо можно поменять название в импорте

// Здесь предоставлен объект, который используется для отобращения контента в приложении.
// Все данные в объекте передаются в контекст, поэтому если будут изминения в данном файле, изменится и контент в проложении.
// Объект содержит 4 секции: контакты с фото, краткая информация, место работы, образование.
// В случае если запутаешься в свойствах, то скопируй данные со страницы и сделай поиск по файлу, и найдешь свой 



const listContents = {
  photo: '',
  //контакты в разных messengers
  asideInfo: [
    {
      svg: email,
      link: 'mailto:vladis62@yandex.ru',
      alt: 'email',//прописывать обязательно, выступает в качестве id
      text: 'vladis62@yandex.ru'
    },
    {
      svg: telegram,
      link: 'https://t.me/vlad_os62',
      alt: 'telegram',//прописывать обязательно, выступает в качестве id
      text: '@vlad_os62'
    },
    {
      svg: phone, //если ты добавил новый контакт, то создай ниже похожий объект и в под данным клучем передавай иконку.
      link: 'tel:+79105700772', //если у тебя нет ссылки, то передавай пустую строку ''
      alt: 'phone', //прописывать обязательно, выступает в качестве id
      text: '+7 (910) 570-07-72'
    },
  ],
  briefInformation: {
    skills: ['Hadoop', 'Grafana', 'Camunda', 'Docker', 'K8s', 'BPMN', 'Redis', 'Clickhouse', 'PostgreSQL', 'Kotlin', 'Python', 'SQL', 'CI/CD', 'Gradle', 'MongoDB', 'Spring Framework', 'Kafka'],// Список скиллов
    aboutMeText: 'Я увлечен программированием. Непрерывно обучаюсь новому, изучаю новые технологии, слушаю IT подкасты (Radio-T, подлодка). Мне нравится создавать действительно полезные продукты, выстраивая согласованную архитектуру в соответствии с лучшими практиками.',// About me текст к отображения
    languages: [
      { id: 'Russian', text: 'Russian | Native' },
      { id: 'English', text: 'English | Flue' },
    ],
  },
  workExperience: [
    {
      nameСompany: 'Tinkoff',
      experience: '2020-н.в',
      tasks: [
        'Спроектировал и разработал BPMN процесс скоринга авто;',
        'Спроектировал и разработал BPMN процесс обработки входящей корреспонденции. Сократил сроки обработки документов и улучшил качество сопровождения продукта;',
        'Реализовал мониторинг и оповещения с использованием Micrometer, Grafana, Prometheus, Slack;',
        'Разработал внутреннюю систему мониторинга и управления приложениями;',
        'Cпроектировал и разработал несколько внутренних интерфейсных приложений на Angular;',
        'Реализовал безопасность приложений за счет разработки контрактов OAuth 2.0 с использование KeyCloak и Spring security;',
        'Спроектировал и разработал систему аудита и отслеживания приложений для отслеживания каждого шага бизнес-процессов;',
        'Разработал высоконагруженные приложения (15-20k RPS) для обработки данных аудита и трассировки и сохранения их в ClickHouse в режиме реального времени;',
        'Разработал высоконагруженный внутренний сервис для мокирования пользовательских rest/soap запросов;',
        'Участвовал в разработке и проектировании внутренней AB платформы, включая создание архитектуры, разработку функционала и тестирования;',
        'Разрабатывал высоконагруженный сервис интеграций с биржами spb/moex;',
        'Разрабатывал сервис начисления промокодов в инвестициях, включая создание архитектуры, разработку функционала и тестирования;',
        'Обучал студентов на внутренних курсах kotlin/java;',
        'Был ментором у студентов и стажеров.',
      ],
      usedStack: {
        programming: ['Kotlin (spring, camunda, junit, coroutines)', 'Docker', 'Kafka', 'SQL', 'TypeScript(angular)'],
        database: ['PostgreSQL', 'ClickHouse', 'Oracle', 'Redis', 'MongoDb'],
        devOps: ['Docker', 'Kubernetes', 'Gitlab', 'TeamCity'],
        technologies: ['Grafana', 'Prometheus', 'Kafka', 'IBM MQ', 'Keycloak', 'Sonarqube', 'Testcontainers', 'REST'],
      },
    },//чтобы добавить организацию скопируй объект выше и создай новый через запятую. После меняешь значения (ключи не трогать!). Если захочешь что-то еще добавить, то пиши мне.
    {
      nameСompany: 'ПАО "завод "Красное знамя""',
      experience: '2020-2019',
      tasks: [
        'Разработка ПО для desktop приложений в кроссплатформенной среде разработки QT на языке C++',
        'Разработка ПО для микроконтроллеров на языке C.'
      ],
      usedStack: '',
    },//чтобы добавить организацию скопируй объект выше и создай новый через запятую. После меняешь значения (ключи не трогать!). Если захочешь что-то еще добавить, то пиши мне.
  ],
  education: {
    publicEducations: [
      {
        institution: 'Рязанский государственный радиотехнический университет, Рязань',
        industry: 'Электроники, Промышленная электроника',
        experience: '2009-2014',
      }
    ],
    courses: [
      {
        institution: 'Яндекс Практикум',
        link: '',
        topic: 'Алгоритмы и структуры данных',
        experience: '2024',
      },
      {
        institution: 'OTUS',
        link: 'https://otus.ru/certificate/d3d08f76f30a4d48a1b2dcaa5cf40729/',
        topic: 'Нереляционные базы данных',
        experience: '2023',
      }
    ]
  },
}

export default listContents;